zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEmem_mpu_bf.h
/** \brief Length for Ifx_EMEM_MPU_ACCEN0_Bits.EN29 */
#define IFX_EMEM_MPU_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN0_Bits.EN29 */
#define IFX_EMEM_MPU_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN0_Bits.EN29 */
#define IFX_EMEM_MPU_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN0_Bits.EN30 */
#define IFX_EMEM_MPU_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN0_Bits.EN30 */
#define IFX_EMEM_MPU_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN0_Bits.EN30 */
#define IFX_EMEM_MPU_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN0_Bits.EN31 */
#define IFX_EMEM_MPU_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN0_Bits.EN31 */
#define IFX_EMEM_MPU_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN0_Bits.EN31 */
#define IFX_EMEM_MPU_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN32 */
#define IFX_EMEM_MPU_ACCEN1_EN32_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN32 */
#define IFX_EMEM_MPU_ACCEN1_EN32_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN32 */
#define IFX_EMEM_MPU_ACCEN1_EN32_OFF (0u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN33 */
#define IFX_EMEM_MPU_ACCEN1_EN33_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN33 */
#define IFX_EMEM_MPU_ACCEN1_EN33_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN33 */
#define IFX_EMEM_MPU_ACCEN1_EN33_OFF (1u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN34 */
#define IFX_EMEM_MPU_ACCEN1_EN34_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN34 */
#define IFX_EMEM_MPU_ACCEN1_EN34_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN34 */
#define IFX_EMEM_MPU_ACCEN1_EN34_OFF (2u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN35 */
#define IFX_EMEM_MPU_ACCEN1_EN35_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN35 */
#define IFX_EMEM_MPU_ACCEN1_EN35_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN35 */
#define IFX_EMEM_MPU_ACCEN1_EN35_OFF (3u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN36 */
#define IFX_EMEM_MPU_ACCEN1_EN36_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN36 */
#define IFX_EMEM_MPU_ACCEN1_EN36_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN36 */
#define IFX_EMEM_MPU_ACCEN1_EN36_OFF (4u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN37 */
#define IFX_EMEM_MPU_ACCEN1_EN37_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN37 */
#define IFX_EMEM_MPU_ACCEN1_EN37_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN37 */
#define IFX_EMEM_MPU_ACCEN1_EN37_OFF (5u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN38 */
#define IFX_EMEM_MPU_ACCEN1_EN38_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN38 */
#define IFX_EMEM_MPU_ACCEN1_EN38_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN38 */
#define IFX_EMEM_MPU_ACCEN1_EN38_OFF (6u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN39 */
#define IFX_EMEM_MPU_ACCEN1_EN39_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN39 */
#define IFX_EMEM_MPU_ACCEN1_EN39_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN39 */
#define IFX_EMEM_MPU_ACCEN1_EN39_OFF (7u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN40 */
#define IFX_EMEM_MPU_ACCEN1_EN40_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN40 */
#define IFX_EMEM_MPU_ACCEN1_EN40_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN40 */
#define IFX_EMEM_MPU_ACCEN1_EN40_OFF (8u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN41 */
#define IFX_EMEM_MPU_ACCEN1_EN41_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN41 */
#define IFX_EMEM_MPU_ACCEN1_EN41_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN41 */
#define IFX_EMEM_MPU_ACCEN1_EN41_OFF (9u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN42 */
#define IFX_EMEM_MPU_ACCEN1_EN42_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN42 */
#define IFX_EMEM_MPU_ACCEN1_EN42_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN42 */
#define IFX_EMEM_MPU_ACCEN1_EN42_OFF (10u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN43 */
#define IFX_EMEM_MPU_ACCEN1_EN43_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN43 */
#define IFX_EMEM_MPU_ACCEN1_EN43_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN43 */
#define IFX_EMEM_MPU_ACCEN1_EN43_OFF (11u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN44 */
#define IFX_EMEM_MPU_ACCEN1_EN44_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN44 */
#define IFX_EMEM_MPU_ACCEN1_EN44_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN44 */
#define IFX_EMEM_MPU_ACCEN1_EN44_OFF (12u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN45 */
#define IFX_EMEM_MPU_ACCEN1_EN45_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN45 */
#define IFX_EMEM_MPU_ACCEN1_EN45_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN45 */
#define IFX_EMEM_MPU_ACCEN1_EN45_OFF (13u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN46 */
#define IFX_EMEM_MPU_ACCEN1_EN46_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN46 */
#define IFX_EMEM_MPU_ACCEN1_EN46_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN46 */
#define IFX_EMEM_MPU_ACCEN1_EN46_OFF (14u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN47 */
#define IFX_EMEM_MPU_ACCEN1_EN47_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN47 */
#define IFX_EMEM_MPU_ACCEN1_EN47_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN47 */
#define IFX_EMEM_MPU_ACCEN1_EN47_OFF (15u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN48 */
#define IFX_EMEM_MPU_ACCEN1_EN48_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN48 */
#define IFX_EMEM_MPU_ACCEN1_EN48_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN48 */
#define IFX_EMEM_MPU_ACCEN1_EN48_OFF (16u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN49 */
#define IFX_EMEM_MPU_ACCEN1_EN49_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN49 */
#define IFX_EMEM_MPU_ACCEN1_EN49_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN49 */
#define IFX_EMEM_MPU_ACCEN1_EN49_OFF (17u)

