zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEmem_mpu_bf.h
/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN28 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN28_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN28 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN28_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN28 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN28_OFF (28u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN29 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN29_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN29 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN29_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN29 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN29_OFF (29u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN30 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN30_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN30 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN30_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN30 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN30_OFF (30u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN31 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN31_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN31 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN31_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN31 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN31_OFF (31u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN32 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN32_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN32 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN32_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN32 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN32_OFF (0u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN33 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN33_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN33 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN33_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN33 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN33_OFF (1u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN34 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN34_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN34 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN34_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN34 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN34_OFF (2u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN35 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN35_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN35 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN35_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN35 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN35_OFF (3u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN36 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN36_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN36 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN36_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN36 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN36_OFF (4u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN37 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN37_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN37 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN37_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN37 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN37_OFF (5u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN38 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN38_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN38 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN38_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN38 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN38_OFF (6u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN39 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN39_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN39 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN39_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN39 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN39_OFF (7u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN40 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN40_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN40 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN40_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN40 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN40_OFF (8u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN41 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN41_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN41 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN41_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN41 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN41_OFF (9u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN42 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN42_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN42 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN42_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN42 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN42_OFF (10u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN43 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN43_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN43 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN43_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN43 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN43_OFF (11u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN44 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN44_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN44 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN44_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN44 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN44_OFF (12u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN45 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN45_LEN (1u)

