zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxEmem_mpu_bf.h
/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN63 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN63_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN63 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN63_OFF (31u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN0 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN0_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN0 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN0_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN0 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN0_OFF (0u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN1 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN1_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN1 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN1_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN1 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN1_OFF (1u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN2 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN2_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN2 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN2_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN2 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN2_OFF (2u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN3 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN3_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN3 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN3_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN3 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN3_OFF (3u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN4 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN4_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN4 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN4_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN4 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN4_OFF (4u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN5 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN5_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN5 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN5_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN5 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN5_OFF (5u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN6 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN6_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN6 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN6_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN6 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN6_OFF (6u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN7 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN7_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN7 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN7_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN7 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN7_OFF (7u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN8 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN8_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN8 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN8_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN8 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN8_OFF (8u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN9 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN9_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN9 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN9_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN9 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN9_OFF (9u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN10 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN10_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN10 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN10_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN10 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN10_OFF (10u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN11 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN11_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN11 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN11_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN11 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN11_OFF (11u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN12 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN12_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN12 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN12_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN12 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN12_OFF (12u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN13 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN13_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN13 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN13_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN13 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN13_OFF (13u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN14 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN14_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN14 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN14_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN14 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN14_OFF (14u)

/** \brief Length for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN15 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN15_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN15 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN15_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA_Bits.EN15 */
#define IFX_EMEM_MPU_RGNACCEN_RGNACCENRA_EN15_OFF (15u)

